worldflyingct/setdevicetool/stm32isp/stm32isp.cpp
                memcpy(bin+addr, serialReadBuff+1, binlen-addr);
                addr = binlen;
                sprintf(buff, "全部读出完成，一共读出%uk数据", addr / 1024);
                // 这里将文件写入
                QFile file(savefilepath);
                if (!file.open(QIODevice::WriteOnly)) {
                    sprintf(buff, "文件打开失败");
                } else {
                    if (file.write((char*)bin, addr) < addr) {
                        sprintf(buff, "文件写入不完整");
                    } else {
                        sprintf(buff, "镜像保存成功");
                    }
                    file.close();
                }
            } else {
                sprintf(buff, "程序内部错误%d", __LINE__);
            }
            ui->tips->appendPlainText(buff);
            CloseSerial();
            btnStatus = BTN_STATUS_IDLE;
            return;
        }
    } else if (chipstep != ISP_READ_THREE && chipstep != ISP_READ_FOUR){
        char buff[64];
        sprintf(buff, "chipstep:0x%02x, bufflen:%d, ack:0x%02x", chipstep, bufflen, serialReadBuff[0]);
        ui->tips->appendPlainText(buff);
        CloseSerial();
        btnStatus = BTN_STATUS_IDLE;
        return;
    }
    timer.stop();
    timer.start(5000);
}

int Stm32Isp::OpenSerial(char *data, qint64 len) {
    char comname[12];
    sscanf(ui->com->currentText().toStdString().c_str(), "%s ", comname);
    serial.setPortName(comname);
    serial.setBaudRate(QSerialPort::Baud115200);
    serial.setParity(QSerialPort::EvenParity);
    serial.setDataBits(QSerialPort::Data8);
    serial.setStopBits(QSerialPort::OneStop);
    serial.setFlowControl(QSerialPort::NoFlowControl);
    if (!serial.open(QIODevice::ReadWrite)) {
        return -1;
    }
    connect(&timer, SIGNAL(timeout()), this, SLOT(TimerOutEvent()));
    connect(&serial, SIGNAL(readyRead()), this, SLOT(ReadSerialData()));
    timer.start(5000);
    serial.write(data, len);
    return 0;
}

void Stm32Isp::CloseSerial() {
    disconnect(&timer, 0, 0, 0);
    timer.stop();
    disconnect(&serial, 0, 0, 0);
    serial.close();
    bufflen = 0;
}

void Stm32Isp::on_openfile_clicked() {
    QString filepath = QFileDialog::getOpenFileName(this, "选择镜像", NULL, "镜像文件(*.hex *.bin)");
    if (filepath.length()) {
        ui->filepath->setText(filepath);
    }
}

void Stm32Isp::on_readchip_clicked() {
    QString filepath = QFileDialog::getSaveFileName(this, "保存镜像", NULL, "镜像文件(*.bin)");
    if (!filepath.length()) {
        ui->tips->appendPlainText("保存文件路径配置错误");
        return;
    }
    savefilepath = filepath;
    sscanf(ui->flashsize->currentText().toStdString().c_str(), "%u", &binlen);
    binlen *= 1024;
    btnStatus = BTN_STATUS_READ;
    retrytime = 0;
    if (issynced) {
        addr = 0;
        chipstep = ISP_READ;
        char buff[2];
        buff[0] = ISP_READ;
        buff[1] = ~buff[0];
        if (OpenSerial(buff, 2)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始读取操作");
    } else {
        chipstep = ISP_SYNC; // sync
        char buff[1];
        buff[0] = ISP_SYNC;
        if (OpenSerial(buff, 1)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始同步串口");
    }
}

void Stm32Isp::on_readchipmsg_clicked() {
    btnStatus = BTN_STATUS_READ_MSG;
    retrytime = 0;
    if (issynced) {
        chipstep = ISP_GETINFO;
        char buff[2];
        buff[0] = ISP_GETINFO;
        buff[1] = ~buff[0];
        if (OpenSerial(buff, 2)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始擦除操作");
    } else {
        chipstep = ISP_SYNC; // sync
        char buff[1];
        buff[0] = ISP_SYNC;
        if (OpenSerial(buff, 1)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始同步串口");
    }
}

void Stm32Isp::on_writechip_clicked() {
    QString filepath = ui->filepath->text();
    int pos = filepath.lastIndexOf(".");
    QString suffix = filepath.mid(pos);
    QFile file(filepath);
    if(!file.open(QIODevice::ReadOnly)) {
        ui->tips->appendPlainText("无法读取烧录文件");
        return;
    }
    QByteArray bytedata = file.readAll();
    file.close();
    unsigned char *chardata = (unsigned char*)bytedata.data();
    if (!suffix.compare(".hex")) {
        if (HexToBin(chardata, bytedata.length(), bin, sizeof(bin), 0x08000000, &binlen) != RES_OK) {
            ui->tips->appendPlainText("hex文件格式错误");
            return;
        }
    } else if (!suffix.compare(".bin")) {
        uint len = bytedata.length();
        if (len > sizeof(bin)) {
            ui->tips->appendPlainText("bin文件太大");
            return;
        }
        memcpy(bin, chardata, len);
        binlen = len;
    } else {
        ui->tips->appendPlainText("文件类型错误");
        return;
    }
/*
    while (binlen % 4 != 0) {
        bin[binlen] = 0xff;
        binlen++;
    }
*/
    btnStatus = BTN_STATUS_WRITE;
    retrytime = 0;
    if (issynced) {
        chipstep = ISP_ERASE;
        char buff[2];
        buff[0] = ISP_ERASE;
        buff[1] = ~buff[0];
        if (OpenSerial(buff, 2)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始擦除操作");
    } else {
        chipstep = ISP_SYNC; // sync
        char buff[1];
        buff[0] = ISP_SYNC;
        if (OpenSerial(buff, 1)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始同步串口");
    }
}

void Stm32Isp::on_erasechip_clicked() {
    btnStatus = BTN_STATUS_ERASE;
    retrytime = 0;
    if (issynced) {
        chipstep = ISP_ERASE;
        char buff[2];
        buff[0] = ISP_ERASE;
        buff[1] = ~buff[0];
        if (OpenSerial(buff, 2)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始擦除操作");
    } else {
        chipstep = ISP_SYNC; // sync
        char buff[1];
        buff[0] = ISP_SYNC;
        if (OpenSerial(buff, 1)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始同步串口");
    }
}

