worldflyingct/setdevicetool/stm32isp/stm32isp.cpp
void Stm32Isp::on_clearlog_clicked() {
    ui->tips->clear();
}

void Stm32Isp::on_writeprotect_clicked() {
    btnStatus = BTN_STATUS_WRITE_PROTECT;
    retrytime = 0;
    if (issynced) {
        chipstep = ISP_WRITEPROTECT;
        char buff[2];
        buff[0] = ISP_WRITEPROTECT;
        buff[1] = ~buff[0];
        if (OpenSerial(buff, 2)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始添加写保护操作");
    } else {
        chipstep = ISP_SYNC; // sync
        char buff[1];
        buff[0] = ISP_SYNC;
        if (OpenSerial(buff, 1)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始同步串口");
    }
}

void Stm32Isp::on_writeunprotect_clicked() {
    btnStatus = BTN_STATUS_WRITE_UNPROTECT;
    retrytime = 0;
    if (issynced) {
        chipstep = ISP_WRITEUNPROTECT;
        char buff[2];
        buff[0] = ISP_WRITEUNPROTECT;
        buff[1] = ~buff[0];
        if (OpenSerial(buff, 2)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始解除写保护操作");
    } else {
        chipstep = ISP_SYNC; // sync
        char buff[1];
        buff[0] = ISP_SYNC;
        if (OpenSerial(buff, 1)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始同步串口");
    }
}

void Stm32Isp::on_readprotect_clicked() {
    btnStatus = BTN_STATUS_READ_PROTECT;
    retrytime = 0;
    if (issynced) {
        chipstep = ISP_READPROTECT;
        char buff[2];
        buff[0] = ISP_READPROTECT;
        buff[1] = ~buff[0];
        if (OpenSerial(buff, 2)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始添加读操作");
    } else {
        chipstep = ISP_SYNC; // sync
        char buff[1];
        buff[0] = ISP_SYNC;
        if (OpenSerial(buff, 1)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始同步串口");
    }
}

void Stm32Isp::on_readunprotect_clicked() {
    btnStatus = BTN_STATUS_READ_UNPROTECT;
    retrytime = 0;
    if (issynced) {
        chipstep = ISP_READUNPROTECT;
        char buff[2];
        buff[0] = ISP_READUNPROTECT;
        buff[1] = ~buff[0];
        if (OpenSerial(buff, 2)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始解除读保护操作");
    } else {
        chipstep = ISP_SYNC; // sync
        char buff[1];
        buff[0] = ISP_SYNC;
        if (OpenSerial(buff, 1)) {
            ui->tips->appendPlainText("串口打开失败");
            return;
        }
        ui->tips->appendPlainText("开始同步串口");
    }
}
